app/views/users/show.html.erb


<% current_user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1